#![allow(warnings)]
//! Rust definition corresponding to equistore-core C-API.
//!
//! This module is exported for advanced users of the equistore crate, but
//! should not be needed by most.

#[cfg_attr(feature="static", link(name="equistore", kind = "static", modifiers = "-whole-archive"))]
#[cfg_attr(not(feature="static"), link(name="equistore", kind = "dylib"))]
extern "C" {}

pub const EQS_SUCCESS: i32 = 0;
pub const EQS_INVALID_PARAMETER_ERROR: i32 = 1;
pub const EQS_IO_ERROR: i32 = 2;
pub const EQS_SERIALIZATION_ERROR: i32 = 3;
pub const EQS_BUFFER_SIZE_ERROR: i32 = 254;
pub const EQS_INTERNAL_ERROR: i32 = 255;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct eqs_block_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct eqs_tensormap_t {
    _unused: [u8; 0],
}
#[doc = " Status type returned by all functions in the C API.\n\n The value 0 (`EQS_SUCCESS`) is used to indicate successful operations,\n positive values are used by this library to indicate errors, while negative\n values are reserved for users of this library to indicate their own errors\n in callbacks."]
pub type eqs_status_t = i32;
#[doc = " A set of labels used to carry metadata associated with a tensor map.\n\n This is similar to a list of `count` named tuples, but stored as a 2D array\n of shape `(count, size)`, with a set of names associated with the columns of\n this array (often called *dimensions*). Each row/entry in this array is\n unique, and they are often (but not always) sorted in lexicographic order.\n\n `eqs_labels_t` with a non-NULL `internal_ptr_` correspond to a\n reference-counted Rust data structure, which allow for fast lookup inside\n the labels with `eqs_labels_positions`."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct eqs_labels_t {
    #[doc = " internal: pointer to the rust `Labels` struct if any, null otherwise"]
    pub internal_ptr_: *mut ::std::os::raw::c_void,
    #[doc = " Names of the dimensions composing this set of labels. There are `size`\n elements in this array, each being a NULL terminated UTF-8 string."]
    pub names: *const *const ::std::os::raw::c_char,
    #[doc = " Pointer to the first element of a 2D row-major array of 32-bit signed\n integer containing the values taken by the different dimensions in\n `names`. Each row has `size` elements, and there are `count` rows in\n total."]
    pub values: *const i32,
    #[doc = " Number of dimensions/size of a single entry in the set of labels"]
    pub size: usize,
    #[doc = " Number entries in the set of labels"]
    pub count: usize,
}
#[test]
fn bindgen_test_layout_eqs_labels_t() {
    const UNINIT: ::std::mem::MaybeUninit<eqs_labels_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<eqs_labels_t>(),
        40usize,
        concat!("Size of: ", stringify!(eqs_labels_t))
    );
    assert_eq!(
        ::std::mem::align_of::<eqs_labels_t>(),
        8usize,
        concat!("Alignment of ", stringify!(eqs_labels_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).internal_ptr_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(eqs_labels_t),
            "::",
            stringify!(internal_ptr_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).names) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(eqs_labels_t),
            "::",
            stringify!(names)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).values) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(eqs_labels_t),
            "::",
            stringify!(values)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(eqs_labels_t),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).count) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(eqs_labels_t),
            "::",
            stringify!(count)
        )
    );
}
#[doc = " A single 64-bit integer representing a data origin (numpy ndarray, rust\n ndarray, torch tensor, fortran array, ...)."]
pub type eqs_data_origin_t = u64;
#[doc = " Representation of a single sample moved from an array to another one"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct eqs_sample_mapping_t {
    #[doc = " index of the moved sample in the input array"]
    pub input: usize,
    #[doc = " index of the moved sample in the output array"]
    pub output: usize,
}
#[test]
fn bindgen_test_layout_eqs_sample_mapping_t() {
    const UNINIT: ::std::mem::MaybeUninit<eqs_sample_mapping_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<eqs_sample_mapping_t>(),
        16usize,
        concat!("Size of: ", stringify!(eqs_sample_mapping_t))
    );
    assert_eq!(
        ::std::mem::align_of::<eqs_sample_mapping_t>(),
        8usize,
        concat!("Alignment of ", stringify!(eqs_sample_mapping_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).input) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(eqs_sample_mapping_t),
            "::",
            stringify!(input)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).output) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(eqs_sample_mapping_t),
            "::",
            stringify!(output)
        )
    );
}
#[doc = " `eqs_array_t` manages n-dimensional arrays used as data in a block or tensor\n map. The array itself if opaque to this library and can come from multiple\n sources: Rust program, a C/C++ program, a Fortran program, Python with numpy\n or torch. The data does not have to live on CPU, or even on the same machine\n where this code is executed.\n\n This struct contains a C-compatible manual implementation of a virtual table\n (vtable, i.e. trait in Rust, pure virtual class in C++); allowing\n manipulation of the array in an opaque way.\n\n **WARNING**: all function implementations **MUST** be thread-safe, and can\n be called from multiple threads at the same time. The `eqs_array_t` itself\n might be moved from one thread to another."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct eqs_array_t {
    #[doc = " User-provided data should be stored here, it will be passed as the\n first parameter to all function pointers below."]
    pub ptr: *mut ::std::os::raw::c_void,
    #[doc = " This function needs to store the \"data origin\" for this array in\n `origin`. Users of `eqs_array_t` should register a single data\n origin with `eqs_register_data_origin`, and use it for all compatible\n arrays."]
    pub origin: ::std::option::Option<
        unsafe extern "C" fn(
            array: *const ::std::os::raw::c_void,
            origin: *mut eqs_data_origin_t,
        ) -> eqs_status_t,
    >,
    #[doc = " Get a pointer to the underlying data storage.\n\n This function is allowed to fail if the data is not accessible in RAM,\n not stored as 64-bit floating point values, or not stored as a\n C-contiguous array."]
    pub data: ::std::option::Option<
        unsafe extern "C" fn(
            array: *mut ::std::os::raw::c_void,
            data: *mut *mut f64,
        ) -> eqs_status_t,
    >,
    #[doc = " Get the shape of the array managed by this `eqs_array_t` in the `*shape`\n pointer, and the number of dimension (size of the `*shape` array) in\n `*shape_count`."]
    pub shape: ::std::option::Option<
        unsafe extern "C" fn(
            array: *const ::std::os::raw::c_void,
            shape: *mut *const usize,
            shape_count: *mut usize,
        ) -> eqs_status_t,
    >,
    #[doc = " Change the shape of the array managed by this `eqs_array_t` to the given\n `shape`. `shape_count` must contain the number of elements in the\n `shape` array"]
    pub reshape: ::std::option::Option<
        unsafe extern "C" fn(
            array: *mut ::std::os::raw::c_void,
            shape: *const usize,
            shape_count: usize,
        ) -> eqs_status_t,
    >,
    #[doc = " Swap the axes `axis_1` and `axis_2` in this `array`."]
    pub swap_axes: ::std::option::Option<
        unsafe extern "C" fn(
            array: *mut ::std::os::raw::c_void,
            axis_1: usize,
            axis_2: usize,
        ) -> eqs_status_t,
    >,
    #[doc = " Create a new array with the same options as the current one (data type,\n data location, etc.) and the requested `shape`; and store it in\n `new_array`. The number of elements in the `shape` array should be given\n in `shape_count`.\n\n The new array should be filled with zeros."]
    pub create: ::std::option::Option<
        unsafe extern "C" fn(
            array: *const ::std::os::raw::c_void,
            shape: *const usize,
            shape_count: usize,
            new_array: *mut eqs_array_t,
        ) -> eqs_status_t,
    >,
    #[doc = " Make a copy of this `array` and return the new array in `new_array`.\n\n The new array is expected to have the same data origin and parameters\n (data type, data location, etc.)"]
    pub copy: ::std::option::Option<
        unsafe extern "C" fn(
            array: *const ::std::os::raw::c_void,
            new_array: *mut eqs_array_t,
        ) -> eqs_status_t,
    >,
    #[doc = " Remove this array and free the associated memory. This function can be\n set to `NULL` is there is no memory management to do."]
    pub destroy: ::std::option::Option<unsafe extern "C" fn(array: *mut ::std::os::raw::c_void)>,
    #[doc = " Set entries in the `output` array (the current array) taking data from\n the `input` array. The `output` array is guaranteed to be created by\n calling `eqs_array_t::create` with one of the arrays in the same block\n or tensor map as the `input`.\n\n The `samples` array of size `samples_count` indicate where the data\n should be moved from `input` to `output`.\n\n This function should copy data from `input[samples[i].input, ..., :]` to\n `array[samples[i].output, ..., property_start:property_end]` for `i` up\n to `samples_count`. All indexes are 0-based."]
    pub move_samples_from: ::std::option::Option<
        unsafe extern "C" fn(
            output: *mut ::std::os::raw::c_void,
            input: *const ::std::os::raw::c_void,
            samples: *const eqs_sample_mapping_t,
            samples_count: usize,
            property_start: usize,
            property_end: usize,
        ) -> eqs_status_t,
    >,
}
#[test]
fn bindgen_test_layout_eqs_array_t() {
    const UNINIT: ::std::mem::MaybeUninit<eqs_array_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<eqs_array_t>(),
        80usize,
        concat!("Size of: ", stringify!(eqs_array_t))
    );
    assert_eq!(
        ::std::mem::align_of::<eqs_array_t>(),
        8usize,
        concat!("Alignment of ", stringify!(eqs_array_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ptr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(eqs_array_t),
            "::",
            stringify!(ptr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).origin) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(eqs_array_t),
            "::",
            stringify!(origin)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(eqs_array_t),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).shape) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(eqs_array_t),
            "::",
            stringify!(shape)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reshape) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(eqs_array_t),
            "::",
            stringify!(reshape)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).swap_axes) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(eqs_array_t),
            "::",
            stringify!(swap_axes)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).create) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(eqs_array_t),
            "::",
            stringify!(create)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).copy) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(eqs_array_t),
            "::",
            stringify!(copy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).destroy) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(eqs_array_t),
            "::",
            stringify!(destroy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).move_samples_from) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(eqs_array_t),
            "::",
            stringify!(move_samples_from)
        )
    );
}
#[doc = " Function pointer to create a new `eqs_array_t` when de-serializing tensor\n maps.\n\n This function gets the `shape` of the array (the `shape` contains\n `shape_count` elements) and should fill `array` with a new valid\n `eqs_array_t` or return non-zero `eqs_status_t`.\n\n The newly created array should contains 64-bit floating points (`double`)\n data, and live on CPU, since equistore will use `eqs_array_t.data` to get\n the data pointer and write to it."]
pub type eqs_create_array_callback_t = ::std::option::Option<
    unsafe extern "C" fn(
        shape: *const usize,
        shape_count: usize,
        array: *mut eqs_array_t,
    ) -> eqs_status_t,
>;
extern "C" {
